Revit 2027 API
RailingType.PrimaryHandrailLateralOffset Property
 The lateral offset of the primary handrail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double PrimaryHandrailLateralOffset { get; }
Public ReadOnly Property PrimaryHandrailLateralOffset As Double
	Get
public:
property double PrimaryHandrailLateralOffset {
	double get ();
}
member PrimaryHandrailLateralOffset : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  The rail has no primary hand rail.
See Also
Reference
RailingType Class
Autodesk.Revit.DB.Architecture Namespace